# Shaikh's real effective exchange rate
### Calculations on the real effectice exchange rate between japan and the US 

The goal is to reproduce figure 11.4 and 11.5 from the book "Capitalism - Competition, Conflict, Crises" 

The real effective exchange rate is calculated as the vertically integrated unit labor costs (vulc) times a factor of the share of exports (tau).

Theta can have the form of the share of exports over GDP (exp/gdp) or of consumer price index over producer price index (CPI/PPI)

Therefore: 

$$ \frac{vulcr}{vulcr*} \cdot \frac{\tau}{\tau*}$$

or equivalent

$$ \frac{(\frac{ULC}{CPI})}{(\frac{ULC*}{CPI*})} \cdot \frac{(\frac{exp}{gdp})}{(\frac{exp*}{gdp*})}$$

# import data

### Japan

In [1]:
import pandas as pd

In [6]:
exp_gdp = pd.read_csv("EXP-GDP/API_NE.EXP.GNFS.ZS_DS2_en_csv_v2_431603.csv",skiprows=3,delimiter=",")
exp_gdp.head(2)

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2015,2016,2017,2018,2019,2020,2021,2022,2023,Unnamed: 68
0,Aruba,ABW,Exports of goods and services (% of GDP),NE.EXP.GNFS.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,72.852913,71.820435,72.548690,72.252774,73.234592,55.326810,69.069709,83.124605,NaN,NaN
1,Africa Eastern and Southern,AFE,Exports of goods and services (% of GDP),NE.EXP.GNFS.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,24.046024,23.249929,23.824897,25.315921,23.903124,22.036160,25.922406,27.595354,24.50316,NaN
2,Afghanistan,AFG,Exports of goods and services (% of GDP),NE.EXP.GNFS.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,10.420817,14.342153,18.380042,NaN,NaN

In [10]:
usd_yen = pd.read_csv("FX-Rate-USD-YEN/dollar-yen-exchange-rate-historical-chart.csv",skiprows=15)
usd_yen.head(2)

         date   value
0  1971-01-04  357.73
1  1971-01-05  357.81

In [5]:
jpn_cpi = pd.read_csv("JPN-CPI/API_FP.CPI.TOTL_DS2_en_csv_v2_527528.csv",skiprows=3,delimiter=",")
#mutations: choose japan - choose years/drop other cols - transpose
jpn_cpi.head(2)

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2015,2016,2017,2018,2019,2020,2021,2022,2023,Unnamed: 68
0,Aruba,ABW,Consumer price index (2010 = 100),FP.CPI.TOTL,NaN,NaN,NaN,NaN,NaN,NaN,...,103.401365,102.438495,101.385139,105.061406,109.534355,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,Consumer price index (2010 = 100),FP.CPI.TOTL,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,Consumer price index (2010 = 100),FP.CPI.TOTL,NaN,NaN,NaN,NaN,NaN,NaN,...,132.883209,138.708666,145.610741,146.522482,149.895975,NaN,NaN,NaN,NaN,NaN

In [11]:
# finished goods PPI 
jpn_ppi = pd.read_csv("JPN-PPI/PISPFG01JPM661N.csv")
jpn_ppi.head(2)

         DATE  PISPFG01JPM661N
0  1960-01-01          62.8903
1  1960-02-01          62.8903

In [12]:
jpn_ulc = pd.read_csv("JPN-ULC/ULQECU01JPQ661S.csv")
jpn_ulc.head(2)

         DATE  ULQECU01JPQ661S
0  1980-01-01        67.467467
1  1980-04-01        68.412182

### United States

In [13]:
us_cpi = pd.read_table("US-CPI/cu.data.1.AllItems")
us_cpi.head(2)

   series_id          year period         value  footnote_codes
0  CUSR0000SA0        1947    M01         21.48             NaN
1  CUSR0000SA0        1947    M02         21.62             NaN

In [15]:
us_ppi = pd.read_table("US-PPI/pc.data.01.aggregates")
us_ppi.head(2)

   series_id                       year period         value footnote_codes
0  PCUADLVWRADLVWR                 2006    M12         100.0            NaN
1  PCUADLVWRADLVWR                 2007    M01         103.7            NaN

In [16]:
us_ulc = pd.read_table("US-ULC/pr.data.1.AllData")
us_ulc.head(2)

   series_id          year period         value footnote_codes
0  PRS30006011        1988    Q01           1.9            NaN
1  PRS30006011        1988    Q02           2.2            NaN